<div class="container customPage">
    <h1>Пользовательское соглашение</h1>
    <p>
        InstaProfi, именуемый в дальнейшем Администрация, адресует настоящее соглашение любому физическому или юридическому лицу ( далее - Пользователь ), который заключает Соглашение, полностью и безоговорочно соглашаясь со всеми его условиями, указанными в настоящем документе. 
        Настоящий документ является публичной офертой ( публичным предложением ), акцептом ( принятием условий ) публичной оферты является совершение действий предусмотренных соглашением ( п.2 ст.437 ГК РФ ).
    </p>
    <h2>1. Определения</h2>
    <p>
        1.1. В соглашении используются термины в следующих значениях:
        <br>1.1.1. Акцепт - полное и безоговорочное принятие Оферты путем осуществления действий, указанных в п. 3.1 Соглашения.
        <br>1.1.2. Контент - все объекты доступные на сайт , в том числе элементы дизайна, текст, графические изображения, иллюстрации, видео, базы данных, звуки и другие объекты.
        <br>1.1.3. Лицензия - право Пользователя использовать Сайт на условиях простой (неисключительной) с сохранением за Администрацией права выдачи лицензий другим лицам.
        <br>1.1.4. Оферта - настоящий документ, размещенный в сети Интернет по адресу: <a href="/term-of-use">https://instaprofi.ru/term-of-use</a>
        <br>1.1.5. Сайт - информационная система, доступная в сети Интернет по адресу
    </p>
    <h2>2. Предмет соглашения</h2>
    <p>
        2.1. Данное соглашение определяет условия и порядок использования Сайта:  <a href="/">https://instaprofi.ru/</a>. В предмет Соглашения входят все функции и сервисы Сайта, а также любое их развитие или добавление новых, доступных в явном виде
        <br>2.2. Администрация гарантирует, что является правообладателем исключительных прав на Сайт, указанного в п.2.1 Соглашения. Все права принадлежат Администрации.
    </p>
    <h2>3. Принятие соглашения</h2>
    <p>
        3.1. Соглашение считается заключенным, если Пользователь поставил отметку о согласии с текстом Соглашения при посещении сайта.
        <br>3.2. Совершая действия по принятию оферты, Пользователь подтверждает свое полное и безоговорочное согласие со всеми условиями настоящего Соглашения и обязуется их соблюдать. Соглашение может быть принято исключительно в целом, без каких-либо оговорок. (п.1 ст. 428 ГК РФ). Администрация и Пользователь совместно именуются “Стороны”, а по отдельности - “Сторона”.
        <br>3.3. Настоящая Оферта не имеет специально установленного срока для ее принятия. Оферта действует с момента ее публикации, а в части изменений - с даты публикации изменений.
        <br>3.4. Условия Соглашения могут быть изменены Администрацией в любое время в одностороннем внесудебном порядке путем опубликования изменений или новой редакции Соглашения по адресу: <a href="/term-of-use">https://instaprofi.ru/term-of-use</a>. Изменения вступают в силу для Пользователя с даты, следующей за датой их публикации, при условии продолжения использования Пользователем Сайта после публикации изменений, либо принятия обновленной версии Соглашения. При несогласии Пользователя с внесенными изменениями он обязан отказаться от использования Сайта.
    </p>
    <h2>4. Права и обязанности сторон</h2>
    <p>
        4.1. Администрация обязуется:
        <br>4.1.1. Информировать по вопросам работы Сайта посредством электронной почты. Контакты службы поддержки размещаются по адресу: <a href="/contacts">https://instaprofi.ru/contacts</a>
        <br>4.1.2. Обеспечить конфиденциальность и защиту информации о Пользователе и информации хранимой пользователем как контент;
        <br>4.2. Пользователь обязуется:
        <br>4.2.1. Использовать сайт только в пределах тех прав и теми способами, которые предусмотрены в Соглашении.
        <br>4.2.2. Не использовать сайт как объект интеллектуальных прав каким-либо способом, не разрешенным Соглашением. Запрещается: воспроизводить Сайт, создавать копии на материальном носителе и в сети Интернет; использовать Сайт для создания производных программных продуктов; пытаться обойти технические ограничения (меры защиты авторских прав) и использовать Сайт каким-либо иным способом, не предусмотренным Соглашением; запрещается декомпилировать, разбирать или каким-либо другим способом пытаться извлечь исходный код программного обеспечения, являющегося элементом Сайта; использовать без специального на то разрешения автоматизированные скрипты (программы, краулеры, боты) для сбора информации на Сайте и(или) взаимодействия с Сайтом и его функционалом; запрещается распространять, продавать, сублицензировать, использовать программное обеспечение, являющееся элементом Сайта, или каким-либо другим способом передавать права на такое программное обеспечение; не использовать программное обеспечение и не осуществлять действия, направленные на нарушение нормального функционирования Сайта.
        <br>4.2.3. Незамедлительно информировать Администрацию обо всех ставших ему известных фактах противоправного использования третьими лицами.
        <br>4.2.4. Соблюдать имущественные и личные неимущественные права третьих лиц, включая авторские и иные права на использование изображений людей, размещать или распространять на Сайте интеллектуальную собственность Пользователей и третьих лиц только с соблюдением положений закона.
        <br>4.2.5. Не загружать, не хранить, не публиковать, не распространять и не предоставлять доступ или иным образом использовать любую информацию, которая:  содержит угрозы, дискредитирует, оскорбляет, порочит честь и достоинство.
        <br>4.2.6. Не осуществлять массовые рассылки сообщений в адрес других пользователей Сайта без их согласия.
        <br>4.3. Администрация вправе:
        <br>4.3.1. Удалить информацию о Пользователе в случае нарушения им условий Соглашения или совершения любых неправомерных действий.
        <br>4.3.2. Собирать (автоматически) информацию, не содержащую персональных сведений и не позволяющую идентифицировать пользователя, в целях распознавания предпочтения посетителей, пользующихся особой популярностью разделов Сайта. Собранная информация не может идентифицировать Пользователя.
        <br>4.3.3. В случае нарушения Пользователем Соглашения, исключительных прав Администрации Сайта, а равно в случае нарушения Пользователем прав третьих лиц с использованием Сайта, расторгнуть соглашение, прекратить доступ Пользователя к Сайту, а также применить к Пользователю иные меры с целью соблюдения требований законодательства или прав законных интересов третьих лиц.
        <br>4.3.4. Удалять пользовательский контент по требования уполномоченных органов или заинтересованных лиц в случае, если данный контент нарушает законодательство или права третьих лиц.
        <br>4.3.5. В любой момент прекратить предоставление доступа к Сайту, а равно частично ограничивать или прекращать работу некоторых функций или сервисов, в том числе, в целях проведения технических работ на Сайте.
        <br>4.4. Пользователь вправе:
        <br>4.4.1. Использовать сайт в пределах и способами, предусмотренными Соглашением.
    </p>
    <h2>5. Порядок использования сайта</h2>
    <p>
        5.1. Пользователю предоставляется возможность использовать сайт в объеме и порядке, установленном Соглашением. Соглашение предусматривает следующие способы использования Сайта:    
        <br>5.1.1. Реализация доступного функционала Сайта
        <br>5.2. Никакие иные права Пользователю не предоставляются, Пользователь не вправе совершать модификацию, переработку, распространение и иные действия.
        <br>5.3. Сайт предоставляет возможность использования функционала по принципу “как есть”. Администрация не гарантирует, что Сайт соответствует или будет соответствовать требованиям Пользователя, что доступ к Сайту будет предоставляться непрерывно, быстро, надежно и без ошибок.
        <br>5.4. Пользователь гарантирует, что имеет все необходимые права на публикуемые материалы (пользовательский контент), которые позволяют разместить материал на Сайте и использовать его в дальнейшем с учетом функций Сайта. Пользователь самостоятельно несет ответственность за соответствие содержания размещаемого контента требованиям действующего законодательства, включая ответственность перед третьими лицами в случаях, когда размещение контента или содержание контента нарушает права и законные интересы третьих лиц, в том числе личные неимущественные права авторов, иные интеллектуальные права третьих лиц, и(или) посягает на принадлежащие им нематериальные блага. В случае, если какое-либо третье лицо предъявляет Администрации претензии в связи с нарушением Пользователем действующих законодательных норм, нарушением прав третьих лиц (в том числе прав на интеллектуальную собственность), Пользователь обязуется компенсировать Администрации все расходы и потери, в том числе оплатить любые компенсации и прочие затраты, связанные с такой претензией.
        <br>5.5. Пользователь безвозмездно предоставляет Администрации неисключительное право на использование Администрацией Пользовательского контента как с указанием, так и без указания имени автора, без обязанности предоставлять отчеты об использовании, без необходимости получения специального разрешения Пользователя и без выплаты авторского вознаграждения, на территории всего мира, с правом Администрации предоставить указанные права использования Пользовательского контента третьим лицам. При этом пользователь признает и соглашается, что Администрация не обязана просматривать Пользовательский контент, а его использование может осуществляться автоматически посредством программных средств. Администрация в праве использовать Пользовательский контент любым способом на любых информационных носителях, включая: воспроизведение путем записи в память ЭВМ; распространение, переработка, доведение до всеобщего сведения, предоставление права использования Пользовательского контента третьим лицам; включение в состав рекламных материалов, направленных на продвижение услуг и продуктов Администрации путем включения в сложное или составное произведение.  При удалении Пользовательского контента с Сайта Администрация вправе сохранять архивные копии Пользовательского контента и не изымать из оборота созданные материалы, которые его содержат.
    </p>
    <h2>6. Конфиденциальность</h2>
    <p>
        6.1. Использование Сайта предусматривает необходимость предоставления, сбора и(или) использования ряда персональных данных. В частности, при предоставлении доступа к Сервису и при его использовании Администрация получает доступ и использует ряд данных, касающихся Пользователя. Политика конфиденциальности Администрации, касающаяся Сервиса, размещена по адресу: https://instaprofi.ru/privacy.
        <br>6.2. Используя Сервис Пользователь, во исполнение требований Федерального закона от 27.07.2006 г. N 152-ФЗ «О персональных данных» предоставляет Администрации свое согласие на обработку любых своих персональных данных, в том числе фамилии, имени и отчества, даты и места рождения, номера мобильного телефона, адреса электронной почты, IP-адреса устройства Пользователя, данных файлов «cookie», информации о веб-браузере Пользователя, технических характеристик устройства и программного обеспечения, используемых Пользователем, даты и времени доступа к Сервису, адресов запрашиваемых страниц веб-сайта, географических координат места нахождения Пользователя и иной другой информации, для следующих целей сроком на 10 (десять) лет:
        <br>1. использование персональных данных Пользователя для работы Сайта;
        <br>2. предоставление Пользователю персонализированной информации при использовании Сайта, в том числе в виде новостей, информации о новых услугах, предлагаемых Администрацией;
        <br>3. осуществление связи с Пользователем, в том числе путем направления уведомлений, запросов и информации, касающейся использования Сервиса, а также обработка запросов от Пользователя;
        <br>4. определение местонахождения Пользователя для обеспечения безопасности, предотвращения мошенничества, предоставления Пользователю информационных услуг, соответствующих его местоположению;
        <br>5. подтверждение достоверности и полноты персональных данных, предоставленных Пользователем;
        <br>6. улучшение качества работы Сайта, уровня удобства их использования, совершенствование Сервиса, разработка новых услуг и предложений для Пользователя;
        <br>7. проведение статистических и иных исследований использования Сервиса на основе обезличенных данных;
        <br>8. проведение рекламных и маркетинговых рассылок с информацией о других услугах, оказываемых Администрацией. Данный пункт Стороны договорились считать предварительным согласием Пользователя на получение рекламы в соответствии с Федеральным законом от 13.03.2006 № 38-ФЗ «О рекламе»;
        <br>9. соблюдение обязательных требований законодательства Российской Федерации.
        <br>6.3. В рамках предоставленного согласия Администрации предоставляется       право на совершение с персональными данными Пользователя любых действий включая, но не ограничиваясь: сбор, систематизацию, накопление, хранение, уточнение (обновление, изменение), использование, передачу, обезличивание, блокирование, уничтожение, передачу персональных данных партнерам Администрации и другим лицам, а также осуществление иных необходимых действий с персональными данными с учетом действующего законодательства.
        <br>6.4. Обработка персональных данных Пользователя разрешается с применением следующих основных способов (но не ограничиваясь ими): хранение, запись на электронные носители и их хранение, составление перечней, маркировка.
        <br>6.5. Обработка персональных данных Пользователя может осуществляться с помощью средств автоматизации и(или) без использования средств автоматизации в соответствии с действующим законодательством.
        <br>6.6. Настоящее согласие на обработку персональных данных Пользователя распространяет свое действие на любую передачу персональных данных Пользователя Администрации, совершенную до предоставления настоящего согласия.
    </p>
    <h2>7. Разрешение споров и удовлетворение претензий</h2>
    <p>
        7.1. Все споры и претензии регулируются на основании положений настоящего Соглашения, а в случае их не урегулирования – в порядке, установленном действующим законодательством. 
        <br>7.2. Любые вопросы, комментарии и иная корреспонденция Пользователя должны направляться Администрации путем отправки электронного сообщения на адрес электронной почты:  info@instaprofi.ru. Администрация не несет ответственности и не гарантирует ответ на запросы, вопросы, предложения и иную информацию, направленные ему любым другим способом
        <br>7.3. Возникшие в связи с настоящим Соглашением претензии направляются Администрации путем отправки электронного сообщения на адрес электронной почты:  info@instaprofi.ru. Администрация обязуется в течение 10 (десяти) рабочих дней рассмотреть данную претензию, при необходимости направив письмо с изложением своей позиции по указанному в претензии адресу электронной почты. При этом претензии Пользователей, которых не представляется возможным идентифицировать на основе предоставленных им при регистрации данных (в том числе анонимные претензии), Администрация не рассматривает. В случае если Пользователь не согласен с мотивами, приведенными Администрацией в ответе на претензию, процедура ее урегулирования повторяется при помощи направления мотивированного ответа Пользователя с использованием почтовой связи, а именно заказным письмом с уведомлением. В случае невозможности разрешения претензии путем переговоров, спор разрешается в судебном порядке в соответствии с настоящим Соглашением.
        <br>7.4. Пользователь и Администрация соглашаются, что при невозможности разрешения споров, возникших в связи с настоящим Соглашением, путем переговоров такие споры разрешаются сторонами по нормам российского и международного права и рассматриваются по месту нахождения Администрации
    </p>
    <h2>8. Срок действия Соглашения</h2>
    <p>
        8.1. Настоящее Соглашение заключается между сторонами на неопределенный срок.
    </p>
    <h2>9. Ответственность сторон</h2>
    <p>
        9.1. Стороны несут ответственность за неисполнение или ненадлежащее исполнение своих обязательств в соответствии с законодательством России.
        <br>9.2. Администрация не принимает на себя ответственность за соответствие Сайта целям использования
        <br>9.3. Администрация не несет ответственности за технические перебои в работе Сайта. Вместе с тем Администрация обязуется принимать все разумные меры по предотвращению сбоев.
        <br>9.4. Администрация не гарантирует, что Сайт будет соответствовать требованиям Пользователя, а также не гарантирует работоспособность Сайта совместно с программным обеспечением и оборудованием других изготовителей; не гарантирует, что Сайт не содержит ошибки, не гарантирует бесперебойную работу Сайта, не гарантирует сохранность данных пользователя; не несет ответственности за результаты, полученные при использовании Сайта, не несет ответственности за прямые или косвенные убытки любого рода, понесенные вследствие использования Сайта.
        <br>9.5. Администрация не имеет технической и фактической возможности проверять всю информацию, размещаемую Пользователем на Сайте, на предмет ее соответствия требованиям законодательства Российской Федерации и положениям Соглашения. поскольку подобная проверка делает невозможным функционирование Сайта. Администрация вправе предпринимать действия по проверке такого контента по собственному усмотрению. Администрация не может гарантировать соответствие такого контента требованиям законодательства Российской Федерации и Международного права и отсутствие нарушений прав и законных интересов третьих лиц.
    </p>
    <h2>10. Разрешение споров</h2>
    <p>
        10.1. Претензионный порядок досудебного урегулирования споров из Соглашения является обязательным.
        <br>10.2. Срок рассмотрения претензионного письма составляет 10 рабочих дней со дня получения последнего адресатом.
        <br>10.3. Споры по настоящему соглашению разрешаются в судебном порядке в соответствии с законодательством
    </p>
    <h2>11. Реквизиты</h2>
    <p>
        11.1. Электронная почта: <a href="mailto:info@instaprofi.ru">info@instaprofi.ru</a>
    </p>
</div>